#+TITLE: Plan for Vlabs Landing Pages
#+AUTHOR: VLEAD
#+DATE: [2017-09-11 Mon]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document contains the realization plan for
    implementing the VLABS portal driven by data.

* Milestones Snapshot
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   | S. | Mi | Req | Milestone                                                                      | Plan | Status | Est | Act   | Issues |
  |   | no | no | Map |                                                                                |      |        | hrs | hrs   |        |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |  1 | [[https://github.com/vlead/vlabs-landing-pages/milestone/4][4]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/4][Dynamically populate all institutes and discipline wise labs using lds]]         | [[https://github.com/vlead/vlabs-landing-pages/blob/styles/src/realization-plan/index.org#loading-data-dynamically-from-lds][ref]]  | Closed |     |       | [[https://github.com/vlead/vlabs-landing-pages/milestone/4?closed=1][ref]]    |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |  2 | [[https://github.com/vlead/vlabs-landing-pages/milestone/1][1]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/1][Building vlabs landing using lab data service]]                                  |      | Closed |     |       | [[https://github.com/vlead/vlabs-landing-pages/milestone/1?closed=1][ref]]    |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |  3 | [[https://github.com/vlead/vlabs-landing-pages/milestone/5][5]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/5][Bug fixing and Search functionality of Vlabs landing page]]                      | [[https://github.com/vlead/vlabs-landing-pages/blob/styles/src/realization-plan/index.org#search-functionality][ref]]  | Closed | 472 | 188.5 | [[https://github.com/vlead/vlabs-landing-pages/milestone/5?closed=1][ref]]    |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |  4 | [[https://github.com/vlead/vlabs-landing-pages/milestone/3][3]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/3][Dynamically build vlabs portal - ssad]]                                          |      | Open   |     |       | [[https://github.com/vlead/vlabs-landing-pages/milestone/3][ref]]    |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |  5 | [[https://github.com/vlead/vlabs-landing-pages/milestone/6][6]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/6][Signup and Login functionality of Vlabs landing pages]]                          | [[https://github.com/vlead/vlabs-landing-pages/blob/styles/src/realization-plan/index.org#login-and-register-functionality][ref]]  | Open   | 122 |       | [[https://github.com/vlead/vlabs-landing-pages/milestone/6][ref]]    |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |  6 | [[https://github.com/vlead/vlabs-landing-pages/milestone/7][7]]  |     | [[https://github.com/vlead/vlabs-landing-pages/milestone/7][Deployment of 'vlabs landing pages' on Testing and Stagging for version v1.2.0]] |      | Closed |     |       | [[https://github.com/vlead/vlabs-landing-pages/milestone/7?closed=1][ref]]    |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  |   |    |    |     | Total                                                                          |      |        | 594 | 188.5 |        |
  | ^ |    |    |     |                                                                                |      |        |  et | at    |        |
  |---+----+----+-----+--------------------------------------------------------------------------------+------+--------+-----+-------+--------|
  #+TBLFM: $2=@#-2::@5$8=remote(tbl-realization-plan-ml-5, $estimated)::@5$9=remote(tbl-realization-plan-ml-5, $actual)::@7$8=remote(tbl-realization-plan-ml-6, $estimated)
  #+TBLFM: @6$8=remote(tbl-realization-plan-ml-5, $estimated)
  #+TBLFM: @6$9=remote(tbl-realization-plan-ml-5, $actual)
  #+TBLFM: @6$8=remote(tbl-realization-plan-ml-6, $estimated)
  #+TBLFM: @6$9=remote(tbl-realization-plan-ml-6, $actual)
  #+TBLFM: $et=vsum(@II+1..@-1)
  #+TBLFM: $at=vsum(@II+1..@-1)

* Plan 
** Login and Register functionality

#+caption:  realization-plan-milestone-6
#+name: tbl-realization-plan-ml-6

|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    S. | Tasks                 | Github |  Expected | Actual |  Estimated | Actual | Status      | Assignee |
|    NO |                       | Issues |    Effort | Effort |     Start, | Start/ |             |          |
|       |                       |        |       (in | (in    |        End | End    |             |          |
|       |                       |        |    person | person |      Dates | Dates  |             |          |
|       |                       |        |    hours) | hours) |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    1. | Adding login          | [[https://github.com/vlead/vlabs-landing-pages/issues/89][#89]]    |        12 | 16     | 13-10-2017 |        | Done        |          |
|       | functionality for     |        |           |        | 17-10-2017 |        |             |          |
|       | vlabs landing page    |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    2. | Adding signup         | [[https://github.com/vlead/vlabs-landing-pages/issues/88][#88]]    |        18 |  6     | 17-10-2017 |        | Done        |          |
|       | functionality for     |        |           |        | 23-10-2017 |        |             |          |
|       | vlabs landing page    |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    3. | Enable Sign up        | [[https://github.com/vlead/vlabs-landing-pages/issues/87][#87]]    |        18 | 24     | 25-10-2017 |        | In progress |          |
|       | and Login buttons     |        |           |        | 01-11-2017 |        |             |          |
|       | (includes             |        |           |        |            |        |             |          |
|       | functionality)        |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    4. | Interaction between   | [[https://github.com/vlead/vlabs-landing-pages/issues/97][#97]]    |        12 | 18     | 02-11-2017 |        | Done        |          |
|       | iframes using         |        |           |        | 04-11-2017 |        |             |          |
|       | postmessage           |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    5. | setup machine to      | [[https://github.com/vlead/vlabs-landing-pages/issues/102][#102]]   |        18 | 20     | 30-10-2017 |        | Done        |          |
|       | run openedx vagrant   |        |           |        | 31-10-2017 |        |             |          |
|       | box for dev           |        |           |        |            |        |             |          |
|       | environment           |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    6. | configure post        | [[https://github.com/vlead/vlabs-landing-pages/issues/121][#121]]   |        12 | 14     |            |        |             |          |
|       | message javascript    |        |           |        |            |        |             |          |
|       | snippet on            |        |           |        |            |        |             |          |
|       | theamless.vlabs.ac.in |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    7. | Styles are breaking,  | [[https://github.com/vlead/vlabs-landing-pages/issues/118][#118]]   |           |        |            |        |             |          |
|       | while traveling       |        |           |        |            |        |             |          |
|       | through browser back  |        |           |        |            |        |             |          |
|       | button from the       |        |           |        |            |        |             |          |
|       | experiment page to    |        |           |        |            |        |             |          |
|       | institutes page       |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    8. | Styles are breaking,  | [[https://github.com/vlead/vlabs-landing-pages/issues/119][#119]]   |           |        |            |        |             |          |
|       | while traveling       |        |           |        |            |        |             |          |
|       | through browser back  |        |           |        |            |        |             |          |
|       | button from the       |        |           |        |            |        |             |          |
|       | experiment page to    |        |           |        |            |        |             |          |
|       | disciplines page      |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|    9. | Bug:Loading labs and  | [[https://github.com/vlead/vlabs-landing-pages/issues/116][#116]]   |           |        |            |        |             |          |
|       | institutes in a same  |        |           |        |            |        |             |          |
|       | page, while traveling |        |           |        |            |        |             |          |
|       | through browser back  |        |           |        |            |        |             |          |
|       | button from the       |        |           |        |            |        |             |          |
|       | experiment page       |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|   10. | Bug: Loading labs and | [[https://github.com/vlead/vlabs-landing-pages/issues/117][#117]]   |           |        |            |        |             |          |
|       | disciplines in a same |        |           |        |            |        |             |          |
|       | page, while traveling |        |           |        |            |        |             |          |
|       | through browser back  |        |           |        |            |        |             |          |
|       | button from the       |        |           |        |            |        |             |          |
|       | experiment page       |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|   11. | Integration of        | [[https://github.com/vlead/vlabs-landing-pages/issues/128][#128]]   |           |        |            |        |             |          |
|       | Openedx urls to       |        |           |        |            |        |             |          |
|       | registration, sign    |        |           |        |            |        |             |          |
|       | in and sign out       |        |           |        |            |        |             |          |
|       | buttons               |        |           |        |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|
|       |                       |        |           |        |            |        |             |          |
|     = |                       |        |           |        |            |        |             |          |
| Total |                       |        |       122 |        |            |        |             |          |
|     ^ |                       |        | estimated | actual |            |        |             |          |
|-------+-----------------------+--------+-----------+--------+------------+--------+-------------+----------|

#+TBLFM: $estimated=vsum(@II+1..@-1)
#+TBLFM: $actual=vsum(@II+1..@-1)

** Search Functionality
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone-one
  :END: 
  Once this milestone is realized, the following are
  completed in the VLABS portal:
  1. Search functionality
  2. Sign n functionality 
  3. Register functionality
  
#+caption:  realization-plan-milestone-5
#+name: tbl-realization-plan-ml-5

|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    S. | Tasks                | Github     |  Expected | Actual |  Estimated |     Actual | Status      | Assignee  |
|    NO |                      | Issues     |    Effort | Effort |     Start, |     Start/ |             |           |
|       |                      |            |       (in |    (in |        End |        End |             |           |
|       |                      |            |    person | person |      Dates |      Dates |             |           |
|       |                      |            |    hours) | hours) |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    1. | Adding key word      | [[https://github.com/vlead/vlabs-landing-pages/issues/86][#86]]        |        48 |        | 27-10-2017 |            | backlog     | Madhavi   |
|       | based search         |            |           |        | 29-10-2017 |            |             |           |
|       | feature              |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    2. | Unable to navigate   | [[https://github.com/vlead/vlabs-landing-pages/issues/85][#85]]        |           |        | 29-10-2017 |            | bug         | Mrudhvika |
|       | institute wise       |            |        32 |        | 30-10-2017 |            |             | Balamma   |
|       | labs from            |            |           |        |            |            |             | Madhavi   |
|       | experiment page      |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    3. | Header and footer    | [[https://github.com/vlead/vlabs-landing-pages/issues/84][#84]]        |        16 |     16 | 16-10-2017 | 16-10-2017 | bug         | Balamma   |
|       | not visible in       |            |           |        | 18-10-2017 | 18-10-2017 | Done        | Mrudhvika |
|       | open-edx labs        |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    4. | Add a Favicon to     | [[https://github.com/vlead/vlabs-landing-pages/issues/83][#83]]        |        03 |     01 | 19-10-2017 | 19-10-2017 | Done        | Balamma   |
|       | vlabs landing page   |            |           |        | 19-10-2017 | 19-10-2017 |             | Mrudhvika |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    5. | Setting of search    | [[https://github.com/vlead/vlabs-landing-pages/issues/82][#82]]        |        06 |     06 | 09-10-2017 | 10-10-2017 | Done        | Balamma   |
|       | icon width and       |            |           |        | 09-10-2017 | 10-10-2017 |             |           |
|       | height               |            |           |        |            |            |             | Mrudhvika |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    6. | Fix Grid layout      | [[https://github.com/vlead/vlabs-landing-pages/issues/81][#81]]        |        16 |        | 12-10-2017 |            | bug         | Balamma   |
|       | styles               |            |           |        | 14-10-2017 |            | In progress | Mrudhvika |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    7. | Header is repeating  | [[https://github.com/vlead/vlabs-landing-pages/issues/80][#80]]        |        32 |     14 | 13-10-2017 | 24-10-2017 | Done        | Mrudhvika |
|       | twice when broswer   |            |           |        | 14-10-2017 | 24-10-2017 |             | Balamma   |
|       | 'back' button was    |            |           |        |            |            |             |           |
|       | clicked              |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    8. | Micro biology I      | [[https://github.com/vlead/vlabs-landing-pages/issues/90][#90]]        |        03 |     03 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|       | and Molecular        |            |           |        | 10-10-2017 | 10-10-2017 |             |           |
|       | fluorescence         |            |           |        |            |            |             |           |
|       | spectroscopy         |            |           |        |            |            |             |           |
|       | have same images     |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|    9. | Verifying the list   | [[https://github.com/vlead/vlabs-landing-pages/issues/91][#91]]        |        03 |     04 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|       | of captured labs.    |            |           |        | 10-10-2017 | 10-10-2017 |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   10. | Remove hyperlink of  | [[https://github.com/vlead/vlabs-landing-pages/issues/92][#92]]        |        04 |     04 | 10-10-2017 | 10-10-2017 | Done        | Mrudhvika |
|       | disciplines titles   |            |           |        | 10-10-2017 | 10-10-2017 |             | Balamma   |
|       | on all disciplines   |            |           |        |            |            |             |           |
|       | page.                |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   11. | Remove hyperlink of  | [[https://github.com/vlead/vlabs-landing-pages/issues/93][#93]]        |        04 |     04 | 11-10-2017 | 11-10-2017 | Done        | Mrudhvika |
|       | institutes titles    |            |           |        | 11-10-2017 | 11-10-2017 |             | Balamma   |
|       | on all institutes    |            |           |        |            |            |             |           |
|       | page.                |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   12. | Align institutes     | [[https://github.com/vlead/vlabs-landing-pages/issues/94][#94]]        |        06 |     04 | 11-10-2017 | 11-10-2017 | Done        | Balamma   |
|       | titles along with    |            |           |        | 11-10-2017 | 11-10-2017 |             | Mrudhvika |
|       | institute logos      |            |           |        |            |            |             |           |
|       | on all institutes.   |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   13. | Align disciplines    | [[https://github.com/vlead/vlabs-landing-pages/issues/95][#95]]        |        06 |     06 | 11-10-2017 | 11-10-2017 | Done        | Balamma   |
|       | titles along with    |            |           |        | 11-10-2017 | 11-10-2017 |             | Mrudhvika |
|       | disciplines logos    |            |           |        |            |            |             |           |
|       | on all disciplines   |            |           |        |            |            |             |           |
|       | page.                |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   14. | Align lab titles     | [[https://github.com/vlead/vlabs-landing-pages/issues/96][#96]]        |        08 |     08 | 12-10-2017 |            | Done        | Balamma   |
|       | along with labs      |            |           |        | 12-10-2017 |            |             | Mrudhvika |
|       | images on all labs   |            |           |        |            |            |             |           |
|       | page                 |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   15. | Changing the lab     | [[https://github.com/vlead/vlabs-landing-pages/issues/98][#98]]        |        04 |     04 | 14-10-2017 | 14-10-2017 | Done        | Mrudhvika |
|       | names in Title       |            |           |        | 14-10-2017 | 14-10-2017 |             | Sanchita  |
|       | case from lower      |            |           |        |            |            |             |           |
|       | case type            |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   16. | Change lab names     | [[https://github.com/vlead/vlabs-landing-pages/issues/99][#99]]        |        08 |     08 | 21-10-2017 | 21-10-2017 | Done        | Balamma   |
|       | styles and images    |            |           |        | 21-10-2017 | 21-10-2017 |             | Mrudhvika |
|       | properties as per    |            |           |        |            |            |             |           |
|       | open edx labs        |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   17. | Change lab names     | [[https://github.com/vlead/vlabs-landing-pages/issues/100][#100]]       |        16 |     16 | 22-10-2017 | 22-10-2017 | Done        | Balamma   |
|       | styles and images    |            |           |        | 22-10-2017 | 22-10-2017 |             | Sanchita  |
|       | properties as per    |            |           |        |            |            |             |           |
|       | open edx labs        |            |           |        |            |            |             |           |
|       | layout on            |            |           |        |            |            |             |           |
|       | individual           |            |           |        |            |            |             |           |
|       | institutes and       |            |           |        |            |            |             |           |
|       | Disciplines          |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   18. | Change lab names     | [[https://github.com/vlead/vlabs-landing-pages/issues/101][#101]]       |        08 |     08 | 13-10-2017 | 13-10-2017 | Done        | Mrudhvika |
|       | styles and images    |            |           |        | 13-10-2017 | 13-10-2017 |             | Sanchita  |
|       | properties as per    |            |           |        |            |            |             |           |
|       | open edx labs        |            |           |        |            |            |             |           |
|       | layout on keyword    |            |           |        |            |            |             |           |
|       | search page          |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   19. | Banner image on      | [[https://github.com/vlead/vlabs-landing-pages/issues/103][#103]]       |        12 |     12 | 12-10-2017 | 12-10-2017 | Done        | Mrudhvika |
|       | vlabs landing pages  |            |           |        | 12-10-2017 | 12-10-2017 |             | Sanchita  |
|       |                      |            |           |        |            |            |             | Balamma   |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   20. | Fixing grid styles   | [[https://github.com/vlead/vlabs-landing-pages/issues/105][#105]]       |        16 |        |            |            |             | Balamma   |
|       | while traversing     |            |           |        |            |            |             | Mrudhvika |
|       | through individual   |            |           |        |            |            |             |           |
|       | institutes and       |            |           |        |            |            |             |           |
|       | disciplines          |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   21. | Recollecting 6 labs  | [[https://github.com/vlead/vlabs-landing-pages/issues/106][#106]]       |        08 |     08 | 17-10-2017 | 17-10-2017 | Done        | Mrudhvika |
|       | images to update     |            |           |        | 17-10-2017 | 17-10-2017 |             |           |
|       | on lds               |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   22. | Remove header        | [[https://github.com/vlead/vlabs-landing-pages/issues/108][#108]]  [[https://github.com/vlead/vlabs-landing-pages/issues/111][#111]] |        10 |     10 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | iframe and create    | [[https://github.com/vlead/vlabs-landing-pages/issues/110][#110]]  [[https://github.com/vlead/vlabs-landing-pages/issues/112][#112]] |           |        | 25-10-2017 | 25-10-2017 |             | Madhavi   |
|       | header division in   | [[https://github.com/vlead/vlabs-landing-pages/issues/113][#113]]  [[https://github.com/vlead/vlabs-landing-pages/issues/114][#114]] |           |        |            |            |             | Mrudhvika |
|       | html                 |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   23. | Unable to navigate   | [[https://github.com/vlead/vlabs-landing-pages/issues/109][#109]]       |        16 |        | 25-10-2017 | 25-10-2017 | In Progress | Madhavi   |
|       | discipline wise      |            |           |        | 26-10-2017 | 26-10-2017 |             |           |
|       | labs from            |            |           |        |            |            |             |           |
|       | experiment page      |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   24. | Adding header        | [[https://github.com/vlead/vlabs-landing-pages/issues/110][#110]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | division to vlabs    |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|       | landing pages.       |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   25. | Adding banner in a   | [[https://github.com/vlead/vlabs-landing-pages/issues/111][#111]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | division to vlabs    |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|       | landing pages.       |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   26. | Adding usage         | [[https://github.com/vlead/vlabs-landing-pages/issues/112][#112]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | section              |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   27. | Fixing the height    | [[https://github.com/vlead/vlabs-landing-pages/issues/113][#113]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | of the content       |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|       | iframe.              |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   28. | Adding styles to     | [[https://github.com/vlead/vlabs-landing-pages/issues/114][#114]]       |        02 |     02 | 25-10-2017 | 25-10-2017 | Done        | Balamma   |
|       | the header division  |            |           |        | 25-10-2017 | 25-10-2017 |             | Mrudhvika |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   29. | After removing the.  | [[https://github.com/vlead/vlabs-landing-pages/issues/115][#115]]       |        32 |     26 | 25-10-2017 | 25-10-2017 | Done        | Madhavi   |
|       | header iframe, Key   |            |           |        | 26-10-2017 | 26-10-2017 |             |           |
|       | word search          |            |           |        |            |            |             |           |
|       | functionality is     |            |           |        |            |            |             |           |
|       | breaking             |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   30. | Bug:Loading labs     | [[https://github.com/vlead/vlabs-landing-pages/issues/116][#116]]       |        32 |        | 25-10-2016 |            | In Progress | Madhavi   |
|       | and institutes in    |            |           |        | 27-10-2016 |            |             | Balamma   |
|       | a same page, while   |            |           |        |            |            |             | Mrudhvika |
|       | traveling through    |            |           |        |            |            |             |           |
|       | browser back         |            |           |        |            |            |             |           |
|       | button from the      |            |           |        |            |            |             |           |
|       | experiment page.     |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   31. | Bug:Loading labs     | [[https://github.com/vlead/vlabs-landing-pages/issues/117][#117]]       |        32 |        | 25-10-2016 |            | In Progress | Madhavi   |
|       | AND Disciplines in   |            |           |        | 27-10-2016 |            |             | Balamma   |
|       | same page, while     |            |           |        |            |            |             | Mrudhvika |
|       | traveling through    |            |           |        |            |            |             |           |
|       | browser back         |            |           |        |            |            |             |           |
|       | button from the      |            |           |        |            |            |             |           |
|       | experiment page      |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   32. | Styles are breaking, | [[https://github.com/vlead/vlabs-landing-pages/issues/118][#118]]       |        32 |        | 25-10-2017 |            | In Progress | Madhavi   |
|       | while traveling      |            |           |        | 27-10-2017 |            |             | Balamma   |
|       | through browser      |            |           |        |            |            |             | Mrudhvika |
|       | back button from     |            |           |        |            |            |             |           |
|       | the experiment       |            |           |        |            |            |             |           |
|       | page to institutes   |            |           |        |            |            |             |           |
|       | page.                |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   33. | Styles are breaking, | [[https://github.com/vlead/vlabs-landing-pages/issues/119][#119]]       |        32 |        | 25-10-2017 |            | In Progress | Madhavi   |
|       | while traveling      |            |           |        | 27-10-2017 |            |             | Balamma   |
|       | through browser      |            |           |        |            |            |             | Mrudhvika |
|       | back button from     |            |           |        |            |            |             |           |
|       | the experiment       |            |           |        |            |            |             |           |
|       | page to disciplines  |            |           |        |            |            |             |           |
|       | page.                |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   34. | Reference            | [[https://github.com/vlead/vlabs-landing-pages/issues/120][#120]]       |        08 |     08 | 26-10-2017 | 26-10-2017 | Done        | Madhavi   |
|       | Error '$'            |            |           |        | 26-10-2017 | 26-10-2017 |             |           |
|       | not defined          |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   35. | Loading all          | [[https://github.com/vlead/vlabs-landing-pages/issues/122][#122]]       |        08 |     08 | 26-10-2017 | 26-10-2017 | Done        | Madhavi   |
|       | disciplines          |            |           |        | 26-10-2017 | 26-10-2017 |             |           |
|       | on home page         |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
|   36. | Fixing institutes    | [[https://github.com/vlead/vlabs-landing-pages/issues/123][#123]]       |        01 |    0.5 | 26-10-2017 | 26-10-2017 | Done        | Balamma   |
|       | and disciplines      |            |           |        | 26-10-2017 | 26-10-2017 |             | Mrudhvika |
|       | icons height         |            |           |        |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
| Total |                      |            |       472 |  188.5 |            |            |             |           |
|     ^ |                      |            | estimated | actual |            |            |             |           |
|-------+----------------------+------------+-----------+--------+------------+------------+-------------+-----------|
#+TBLFM: $estimated=vsum(@II+1..@-1)
#+TBLFM: $actual=vsum(@II+1..@-1)

** Loading data dynamically from LDS

  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone-one
  :END: 
  Once this milestone is realized, the following are done to
  the VLABS portal:
  1. All institutes can be populated dynamically.
  2. All Disciplines can be populated dynamically.
  3. All labs can be populated dynamically on clicking on
     each institute.
  4. All labs can be populated dynamically clicking on each
     discipline.
  5. All labs can be populated dynamically.
  6. Styles can be applied dynamically.
  7. Footer service can be integrated as a service.
 

#+caption:  realization-plan-milestone-4
#+name: tbl-realization-plan-ml-4
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    S. | Tasks                | Github | Expected | Actual |     Actual |  Estimated | Status   | Assignee   |
|    NO |                      | Issues |   Effort | Effort |     Start, |     Start/ |          |            |
|       |                      |        |      (in |    (in |        End |        End |          |            |
|       |                      |        |   person | person |      Dates |      Dates |          |            |
|       |                      |        |   hours) | hours) |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    1. | Ability to           | [[https://github.com/vlead/vlabs-landing-pages/issues/2][#2]]     |       42 |     30 | 31-08-2017 | 31-08-2017 | Done     | Madhavi    |
|       | display the          |        |          |        | 07-09-2017 | 09-09-2017 |          | Mrudhvika  |
|       | labs                 |        |          |        |            |            |          |            |
|       | developed            |        |          |        |            |            |          |            |
|       | by Partner           |        |          |        |            |            |          |            |
|       | Institutes           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    2. | Dynamic footer       | [[https://github.com/vlead/vlabs-landing-pages/issues/21][#21]]    |       24 |     32 | 29-08-2017 | 29-08-2017 | Done     | Sanchita   |
|       | service need to      |        |          |        | 05-09-2017 | 31-08-2017 |          |            |
|       | be integrated        |        |          |        |            |            |          |            |
|       | into an iframe       |        |          |        |            |            |          |            |
|       | of landing page      |        |          |        |            |            |          |            |
|       |                      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    3. | Update the hosted    | [[https://github.com/vlead/vlabs-landing-pages/issues/25][#25]]    |        8 |      8 | 07-09-2017 | 07-09-2017 | Done     | Sanchita   |
|       | URLs of labs in LDS  |        |          |        | 08-09-2017 | 08-09-2017 |          |            |
|       | with openedx URLs    |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    4. | collect thumbnail    | [[https://github.com/vlead/vlabs-landing-pages/issues/24][#24]]    |       24 |     24 | 31-08-2017 | 31-08-2017 | Done     | Balamma    |
|       | for all the          |        |          |        | 03-09-2017 | 03-09-2017 |          |            |
|       | labs                 |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    5. | All labs are loading | [[https://github.com/vlead/vlabs-landing-pages/issues/71][#71]]    |          |        |            |            | backlog  | Madhvi     |
|       | 3 labs in a row      |        |          |        |            |            |          | Mrudhvika  |
|       | instead it should    |        |        8 |      8 | 31-08-2017 | 31-08-2017 | Done     | Sanchita   |
|       | load 4 labs          |        |          |        |            |            |          | Balamma    |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    6. | Labs hosted on       | [[https://github.com/vlead/vlabs-landing-pages/issues/30][#30]]    |        8 |    0.5 | 11-09-2017 | 11-09-2017 | Done     | Madhavi    |
|       | 'open-edx' are       |        |          |        | 11-09-2017 | 11-09-2017 |          |            |
|       | not loading          |        |          |        |            |            |          |            |
|       | in an iframe         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    7. | current theming      | [[https://github.com/vlead/vlabs-landing-pages/issues/31][#31]]    |          |        |            |            | Done     | Shiva      |
|       | for open-edx         |        |          |        |            |            |          | Raghupathi |
|       | labs has to          |        |          |        |            |            |          |            |
|       | be removed           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    8. | create test          | [[https://github.com/vlead/vlabs-landing-pages/issues/32][#32]]    |          |        |            |            | Done     | Shiva      |
|       | open-edx instance    |        |          |        |            |            |          | Raghupathi |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    9. | Deploy all the       | [[https://github.com/vlead/vlabs-landing-pages/issues/33][#33]]    |          |        |            |            |          | Shiva      |
|       | labs on test         |        |          |        |            |            | Done     | Raghupathi |
|       | open-edx instance    |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   10. | Remove theming       | [[https://github.com/vlead/vlabs-landing-pages/issues/34][#34]]    |        8 |        |            |            | Done     | Shiva      |
|       | from test            |        |          |        |            |            |          | Raghupathi |
|       | instance of          |        |          |        |            |            |          |            |
|       | open-edx             |        |          |        |            |            |          |            |
|       | 'hosting_info'       |        |          |        | 14-09-2017 | 14-09-2017 |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   11. | Add a new row to     | [[https://github.com/vlead/vlabs-landing-pages/issues/35][#35]]    |        8 |      8 | 14-09-2017 | 14-09-2017 | Done     | Mrudhvika  |
|       | of 'lab' table       |        |          |        | 14-09-2017 | 14-09-2017 |          |            |
|       | and update           |        |          |        |            |            |          |            |
|       | 'hosted_on' to       |        |          |        |            |            |          |            |
|       | 'test-openedx'       |        |          |        |            |            |          |            |
|       | and also             |        |          |        |            |            |          |            |
|       | update               |        |          |        |            |            |          |            |
|       | 'hosted_url'         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   12. | Update config in     | [[https://github.com/vlead/vlabs-landing-pages/issues/36][#36]]    |       12 |      9 | 14-09-2017 | 14-09-2017 | Done     | Madhavi    |
|       | the vlabs landing    |        |          |        | 15-09-2017 | 15-09-2017 |          |            |
|       | pages to read        |        |          |        |            |            |          |            |
|       | either the           |        |          |        |            |            |          |            |
|       | hosted url of        |        |          |        |            |            |          |            |
|       | production or        |        |          |        |            |            |          |            |
|       | test instance of     |        |          |        |            |            |          |            |
|       | openedx              |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   13. | Some labs are        | [[https://github.com/vlead/vlabs-landing-pages/issues/37][#37]]    |       16 |        | 09-09-2017 | 09-09-2017 | In       | Sanchita   |
|       | not captured in      |        |          |        | 11-09-2017 |            | Progress |            |
|       | lds database         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   14. | Styling for          |        |          |        |            |            | In       | Balamma    |
|       | vlabs-landing-pages  | [[https://github.com/vlead/vlabs-landing-pages/issues/29][#29]]    |          |        |            |            | progress |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   15. | Populate 'Asset      |        |       12 |      8 | 09-09-2017 | 09-09-2017 | Done     | Mrudhvika  |
|       | Urls' for all        | [[https://github.com/vlead/vlabs-landing-pages/issues/28][#28]]    |          |        | 09-09-2017 | 09-09-2017 |          |            |
|       | the Labs in LDS.     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   16. | Ability to display   | [[https://github.com/vlead/vlabs-landing-pages/issues/3][#3]]     |       18 |     24 | 30-08-2017 | 30-08-2017 | Done     | Madhavi    |
|       | all Discipline and   |        |          |        | 05-09-2017 | 04-09-2017 |          |            |
|       | Domain wise labs     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   17. | Header Styling for   | [[https://github.com/vlead/vlabs-landing-pages/issues/41][#41]]    |       40 |     40 | 04-09-2017 | 04-09-2017 | Done     | Balamma    |
|       | Vlabs landing page   |        |          |        | 08-09-2017 | 08-09-2017 |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   18. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/43][#43]]    |       40 |     36 | 11-09-2017 | 11-09-2017 | Done     | Balamma    |
|       | for Institutes       |        |          |        | 13-09-2017 | 15-09-2017 |          | Madhavi    |
|       | images               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   19. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/44][#44]]    |       40 |     36 | 13-09-2017 | 13-09-2017 | Done     | Balamma    |
|       | for Disciplines      |        |          |        | 15-09-2017 | 15-09-2017 |          | Madhavi    |
|       | images               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   20. | Apply grid styles    | [[https://github.com/vlead/vlabs-landing-pages/issues/45][#45]]    |       40 |     36 | 15-09-2017 | 13-09-2017 | Done     | Balamma    |
|       | for All Labs images  |        |          |        | 19-09-2017 | 15-09-2017 |          | Madhavi    |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   21. | Requirements for     | [[https://github.com/vlead/vlabs-landing-pages/issues/10][#10]]    |        6 |      2 | 30-09-2017 | 30-09-2017 | Done     | Thirumal   |
|       | Vlabs Landing Pages  |        |          |        | 30-09-2017 | 30-09-2017 |          | Madhavi    |
|       |                      |        |          |        |            |            |          | Balamma    |
|       |                      |        |          |        |            |            |          | Mrudhvika  |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   22. | Design for           | [[https://github.com/vlead/vlabs-landing-pages/issues/9][#9]]     |        2 |    0.5 | 13-09-2017 | 13-09-2017 | Done     | Mrudhvika  |
|       | Vlabs Landing Page   |        |          |        | 13-09-2017 | 13-09-2017 |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   23. | Setting up           | [[https://github.com/vlead/vlabs-landing-pages/issues/27][#27]]    |      0.5 |    0.5 | 08-09-2017 | 08-09-2017 | Done     | Madhavi    |
|       | Incremental build    |        |          |        | 08-09-2017 | 08-09-2017 |          | Mrudhvika  |
|       | in local machine     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   24. | Set up               | [[https://github.com/vlead/vlabs-landing-pages/issues/18][#18]]    |        1 |      1 | 31-08-2017 | 31-08-2017 | Done     | Madhavi    |
|       | lab data service     |        |          |        | 31-08-2017 | 31-08-2017 |          | Mrudhvika  |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   25. | change 'institute'   | [[https://github.com/vlead/vlabs-landing-pages/issues/51][#51]]    |          |        |            |            |          |            |
|       | tab in the header    |        |          |        |            |            |          |            |
|       | to drop down menu    |        |          |        |            |            |          |            |
|       | to display all       |        |          |        |            |            |          |            |
|       | institutes           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   26. | change 'discipline'  | [[https://github.com/vlead/vlabs-landing-pages/issues/52][#52]]    |          |        |            |            |          |            |
|       | tab in the header    |        |          |        |            |            |          |            |
|       | to drop down menu    |        |          |        |            |            |          |            |
|       | to display all       |        |          |        |            |            |          |            |
|       | disciplines          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   27. | check the images     | [[https://github.com/vlead/vlabs-landing-pages/issues/54][#54]]    |          |        |            |            |          |            |
|       | for all the labs     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   28. | Syntax error in      | [[https://github.com/vlead/vlabs-landing-pages/issues/55][#55]]    |          |        |            |            |          |            |
|       | footer               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   29. | Reference Error:     | [[https://github.com/vlead/vlabs-landing-pages/issues/56][#56]]    |          |        |            |            |          |            |
|       | $ is not defined     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|   30. | Collect Discipline   | [[https://github.com/vlead/vlabs-landing-pages/issues/22][#22]]    |          |        |            |            |          |            |
|       | and institute images |        |          |        |            |            |          |            |
|       | and update their     |        |          |        |            |            |          |            |
|       | links in lds         |        |          |        |            |            |          |            |
|       |                      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    31 | Footer edges should  | [[https://github.com/vlead/vlabs-landing-pages/issues/73][#73]]    |          |        |            |            |          |            |
|       | be same as iframe    |        |          |        |            |            |          |            |
|       | edges                |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    32 | Deployment of        |        |          |        |            |            |          |            |
|       | vlabs-landing-pages  | [[https://github.com/vlead/vlabs-landing-pages/issues/76][#76]]    |          |        |            |            |          |            |
|       | on testing and       |        |          |        |            |            |          |            |
|       | staging              |        |          |        |            |            |          |            |
|       | environments         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    33 | all fonts should     | [[https://github.com/vlead/vlabs-landing-pages/issues/72][#72]]    |          |        |            |            |          |            |
|       | be consistency       |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    34 | Maintain separate    | [[https://github.com/vlead/vlabs-landing-pages/issues/61][#61]]    |          |        |            |            |          |            |
|       | Javascript files     |        |          |        |            |            |          |            |
|       | for individual       |        |          |        |            |            |          |            |
|       | frames               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    35 | Load 'Usage' and     | [[https://github.com/vlead/vlabs-landing-pages/issues/74][#74]]    |          |        |            |            |          |            |
|       | 'Workshop Usage'     |        |          |        |            |            |          |            |
|       | page in content      |        |          |        |            |            |          |            |
|       | Iframe               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    36 | All labs are         | [[https://github.com/vlead/vlabs-landing-pages/issues/79][#79]]    |          |        |            |            |          |            |
|       | loading 3 labs       |        |          |        |            |            |          |            |
|       | in a row instead     |        |          |        |            |            |          |            |
|       | it should load       |        |          |        |            |            |          |            |
|       | 4 labs.              |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    37 | Collect other        | [[https://github.com/vlead/vlabs-landing-pages/issues/67][#67]]    |          |        |            |            |          |            |
|       | discipline           |        |          |        |            |            |          |            |
|       | icons/images         |        |          |        |            |            |          |            |
|       | and update them      |        |          |        |            |            |          |            |
|       | in the database      |        |          |        |            |            |          |            |
|       | and also in the      |        |          |        |            |            |          |            |
|       | file server          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    38 | Header Iframe is     | [[https://github.com/vlead/vlabs-landing-pages/issues/14][#14]]    |          |        |            |            |          |            |
|       | overlapping with     |        |          |        |            |            |          |            |
|       | content Iframe       |        |          |        |            |            |          |            |
|       |                      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    39 | Remove extra white   | [[https://github.com/vlead/vlabs-landing-pages/issues/69][#69]]    |          |        |            |            |          |            |
|       | space between items  |        |          |        |            |            |          |            |
|       | in 'Institute' and   |        |          |        |            |            |          |            |
|       | 'Discipline'         |        |          |        |            |            |          |            |
|       | drop down menu       |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    40 | Add banner/slider    | [[https://github.com/vlead/vlabs-landing-pages/issues/64][#64]]    |          |        |            |            |          |            |
|       | on the home page     |        |          |        |            |            |          |            |
|       | of dynamic vlabs     |        |          |        |            |            |          |            |
|       | portal               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    41 | Add 'Analytics'      | [[https://github.com/vlead/vlabs-landing-pages/issues/68][#68]]    |          |        |            |            |          |            |
|       | band below the       |        |          |        |            |            |          |            |
|       | banner to show       |        |          |        |            |            |          |            |
|       | various usage        |        |          |        |            |            |          |            |
|       | counts               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    42 | Onload display       | [[https://github.com/vlead/vlabs-landing-pages/issues/66][#66]]    |          |        |            |            |          |            |
|       | all Disciplines      |        |          |        |            |            |          |            |
|       | on home page         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    43 | Apply 'Grid Style'   | [[https://github.com/vlead/vlabs-landing-pages/issues/62][#62]]    |          |        |            |            |          |            |
|       | to each institute    |        |          |        |            |            |          |            |
|       | labs selected from   |        |          |        |            |            |          |            |
|       | 'Institute Combo     |        |          |        |            |            |          |            |
|       | box'                 |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    44 | Apply 'Grid Style'   | [[https://github.com/vlead/vlabs-landing-pages/issues/63][#63]]    |          |        |            |            |          |            |
|       | to each discipline   |        |          |        |            |            |          |            |
|       | wise labs selected   |        |          |        |            |            |          |            |
|       | from 'Discipline     |        |          |        |            |            |          |            |
|       | Combo box'           |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    45 | Add 'Hyperlink'      | [[https://github.com/vlead/vlabs-landing-pages/issues/59][#59]]    |          |        |            |            |          |            |
|       | to lab image         |        |          |        |            |            |          |            |
|       | and lab name         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    46 | Implementation       | [[https://github.com/vlead/vlabs-landing-pages/issues/5][#5]]     |          |        |            |            |          |            |
|       | of Header for        |        |          |        |            |            |          |            |
|       | vlabs landing        |        |          |        |            |            |          |            |
|       | page                 |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    47 | Ability to display   | [[https://github.com/vlead/vlabs-landing-pages/issues/1][#1]]     |          |        |            |            |          |            |
|       | All Labs             |        |          |        |            |            |          |            |
|       | dynamically          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    48 | Apply hidden to      | [[https://github.com/vlead/vlabs-landing-pages/issues/58][#58]]    |          |        |            |            |          |            |
|       | 'Search', 'SignUp'   |        |          |        |            |            |          |            |
|       | and 'Login' buttons  |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    49 | Update the Asset     | [[https://github.com/vlead/vlabs-landing-pages/issues/53][#53]]    |          |        |            |            |          |            |
|       | urls images of       |        |          |        |            |            |          |            |
|       | non-openedx labs     |        |          |        |            |            |          |            |
|       | in lds database      |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    50 | Collect Images for   | [[https://github.com/vlead/vlabs-landing-pages/issues/47][#47]]    |          |        |            |            |          |            |
|       | non-openedx labs     |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    51 | Consistency size     | [[https://github.com/vlead/vlabs-landing-pages/issues/48][#48]]    |          |        |            |            |          |            |
|       | of All labs Images   |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    52 | Consistency size     | [[https://github.com/vlead/vlabs-landing-pages/issues/49][#49]]    |          |        |            |            |          |            |
|       | of All Institutes    |        |          |        |            |            |          |            |
|       | Images               |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    53 | Footer Service       | [[https://github.com/vlead/vlabs-landing-pages/issues/13][#13]]    |          |        |            |            |          |            |
|       | Integration          |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
|    54 | design of the        | [[https://github.com/vlead/vlabs-landing-pages/issues/20][#20]]    |          |        |            |            |          |            |
|       | VLABS portal         |        |          |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
| Total |                      |        |    357.5 |        |            |            |          |            |
|     ^ |                      |        |    total |        |            |            |          |            |
|-------+----------------------+--------+----------+--------+------------+------------+----------+------------|
#+TBLFM: $total=vsum(@II+1..@-1)

